grevaillot/svd_tools/headers/STM32G471xx/fdcan.h
/** @defgroup fdcan_tocv TOCV FDCAN Timeout Counter Value Register
@{*/


#define FDCAN_TOCV_TOC_SHIFT		0
#define FDCAN_TOCV_TOC_MASK		0xffff
/** @defgroup fdcan_tocv_toc TOC TOC
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan_ecr ECR FDCAN Error Counter Register
@{*/


#define FDCAN_ECR_CEL_SHIFT		16
#define FDCAN_ECR_CEL_MASK		0xff
/** @defgroup fdcan_ecr_cel CEL CEL
@{*/
/**@}*/

/** FDCAN_ECR_RP RP **/
#define FDCAN_ECR_RP		(1 << 15)

#define FDCAN_ECR_TREC_SHIFT		8
#define FDCAN_ECR_TREC_MASK		0x7f
/** @defgroup fdcan_ecr_trec TREC TREC
@{*/
/**@}*/


#define FDCAN_ECR_TEC_SHIFT		0
#define FDCAN_ECR_TEC_MASK		0xff
/** @defgroup fdcan_ecr_tec TEC TEC
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan_psr PSR FDCAN Protocol Status Register
@{*/


#define FDCAN_PSR_TDCV_SHIFT		16
#define FDCAN_PSR_TDCV_MASK		0x7f
/** @defgroup fdcan_psr_tdcv TDCV TDCV
@{*/
/**@}*/

/** FDCAN_PSR_PXE PXE **/
#define FDCAN_PSR_PXE		(1 << 14)
/** FDCAN_PSR_REDL REDL **/
#define FDCAN_PSR_REDL		(1 << 13)
/** FDCAN_PSR_RBRS RBRS **/
#define FDCAN_PSR_RBRS		(1 << 12)
/** FDCAN_PSR_RESI RESI **/
#define FDCAN_PSR_RESI		(1 << 11)

#define FDCAN_PSR_DLEC_SHIFT		8
#define FDCAN_PSR_DLEC_MASK		0x07
/** @defgroup fdcan_psr_dlec DLEC DLEC
@{*/
/**@}*/

/** FDCAN_PSR_BO BO **/
#define FDCAN_PSR_BO		(1 << 7)
/** FDCAN_PSR_EW EW **/
#define FDCAN_PSR_EW		(1 << 6)
/** FDCAN_PSR_EP EP **/
#define FDCAN_PSR_EP		(1 << 5)

#define FDCAN_PSR_ACT_SHIFT		3
#define FDCAN_PSR_ACT_MASK		0x03
/** @defgroup fdcan_psr_act ACT ACT
@{*/
/**@}*/


#define FDCAN_PSR_LEC_SHIFT		0
#define FDCAN_PSR_LEC_MASK		0x07
/** @defgroup fdcan_psr_lec LEC LEC
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan_tdcr TDCR FDCAN Transmitter Delay Compensation Register
@{*/


#define FDCAN_TDCR_TDCO_SHIFT		8
#define FDCAN_TDCR_TDCO_MASK		0x7f
/** @defgroup fdcan_tdcr_tdco TDCO TDCO
@{*/
/**@}*/


#define FDCAN_TDCR_TDCF_SHIFT		0
#define FDCAN_TDCR_TDCF_MASK		0x7f
/** @defgroup fdcan_tdcr_tdcf TDCF TDCF
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan_ir IR The flags are set when one of the listed conditions is detected (edge-sensitive). The flags remain set until the Host clears them. A flag is cleared by writing a 1 to the corresponding bit position. Writing a 0 has no effect. A hard reset will clear the register. The configuration of IE controls whether an interrupt is generated. The configuration of ILS controls on which interrupt line an interrupt is signaled.
@{*/

/** FDCAN_IR_ARA ARA **/
#define FDCAN_IR_ARA		(1 << 29)
/** FDCAN_IR_PED PED **/
#define FDCAN_IR_PED		(1 << 28)
/** FDCAN_IR_PEA PEA **/
#define FDCAN_IR_PEA		(1 << 27)
/** FDCAN_IR_WDI WDI **/
#define FDCAN_IR_WDI		(1 << 26)
/** FDCAN_IR_BO BO **/
#define FDCAN_IR_BO		(1 << 25)
/** FDCAN_IR_EW EW **/
#define FDCAN_IR_EW		(1 << 24)
/** FDCAN_IR_EP EP **/
#define FDCAN_IR_EP		(1 << 23)
/** FDCAN_IR_ELO ELO **/
#define FDCAN_IR_ELO		(1 << 22)
/** FDCAN_IR_DRX DRX **/
#define FDCAN_IR_DRX		(1 << 19)
/** FDCAN_IR_TOO TOO **/
#define FDCAN_IR_TOO		(1 << 18)
/** FDCAN_IR_MRAF MRAF **/
#define FDCAN_IR_MRAF		(1 << 17)
/** FDCAN_IR_TSW TSW **/
#define FDCAN_IR_TSW		(1 << 16)
/** FDCAN_IR_TEFL TEFL **/
#define FDCAN_IR_TEFL		(1 << 15)
/** FDCAN_IR_TEFF TEFF **/
#define FDCAN_IR_TEFF		(1 << 14)
/** FDCAN_IR_TEFW TEFW **/
#define FDCAN_IR_TEFW		(1 << 13)
/** FDCAN_IR_TEFN TEFN **/
#define FDCAN_IR_TEFN		(1 << 12)
/** FDCAN_IR_TFE TFE **/
#define FDCAN_IR_TFE		(1 << 11)
/** FDCAN_IR_TCF TCF **/
#define FDCAN_IR_TCF		(1 << 10)
/** FDCAN_IR_TC TC **/
#define FDCAN_IR_TC		(1 << 9)
/** FDCAN_IR_HPM HPM **/
#define FDCAN_IR_HPM		(1 << 8)
/** FDCAN_IR_RF1L RF1L **/
#define FDCAN_IR_RF1L		(1 << 7)
/** FDCAN_IR_RF1F RF1F **/
#define FDCAN_IR_RF1F		(1 << 6)
/** FDCAN_IR_RF1W RF1W **/
#define FDCAN_IR_RF1W		(1 << 5)
/** FDCAN_IR_RF1N RF1N **/
#define FDCAN_IR_RF1N		(1 << 4)
/** FDCAN_IR_RF0L RF0L **/
#define FDCAN_IR_RF0L		(1 << 3)
/** FDCAN_IR_RF0F RF0F **/
#define FDCAN_IR_RF0F		(1 << 2)
/** FDCAN_IR_RF0W RF0W **/
#define FDCAN_IR_RF0W		(1 << 1)
/** FDCAN_IR_RF0N RF0N **/
#define FDCAN_IR_RF0N		(1 << 0)

/**@}*/

/** @defgroup fdcan_ie IE The settings in the Interrupt Enable register determine which status changes in the Interrupt Register will be signaled on an interrupt line.
@{*/

/** FDCAN_IE_ARAE ARAE **/
#define FDCAN_IE_ARAE		(1 << 29)
/** FDCAN_IE_PEDE PEDE **/
#define FDCAN_IE_PEDE		(1 << 28)
/** FDCAN_IE_PEAE PEAE **/
#define FDCAN_IE_PEAE		(1 << 27)
/** FDCAN_IE_WDIE WDIE **/
#define FDCAN_IE_WDIE		(1 << 26)
/** FDCAN_IE_BOE BOE **/
#define FDCAN_IE_BOE		(1 << 25)
/** FDCAN_IE_EWE EWE **/
#define FDCAN_IE_EWE		(1 << 24)
/** FDCAN_IE_EPE EPE **/
#define FDCAN_IE_EPE		(1 << 23)
/** FDCAN_IE_ELOE ELOE **/
#define FDCAN_IE_ELOE		(1 << 22)
/** FDCAN_IE_BEUE BEUE **/
#define FDCAN_IE_BEUE		(1 << 21)
/** FDCAN_IE_BECE BECE **/
#define FDCAN_IE_BECE		(1 << 20)
/** FDCAN_IE_DRX DRX **/
#define FDCAN_IE_DRX		(1 << 19)
/** FDCAN_IE_TOOE TOOE **/
#define FDCAN_IE_TOOE		(1 << 18)
/** FDCAN_IE_MRAFE MRAFE **/
#define FDCAN_IE_MRAFE		(1 << 17)
/** FDCAN_IE_TSWE TSWE **/
#define FDCAN_IE_TSWE		(1 << 16)
/** FDCAN_IE_TEFLE TEFLE **/
#define FDCAN_IE_TEFLE		(1 << 15)
/** FDCAN_IE_TEFFE TEFFE **/
#define FDCAN_IE_TEFFE		(1 << 14)
/** FDCAN_IE_TEFWE TEFWE **/
#define FDCAN_IE_TEFWE		(1 << 13)
/** FDCAN_IE_TEFNE TEFNE **/
#define FDCAN_IE_TEFNE		(1 << 12)
/** FDCAN_IE_TFEE TFEE **/
#define FDCAN_IE_TFEE		(1 << 11)
/** FDCAN_IE_TCFE TCFE **/
#define FDCAN_IE_TCFE		(1 << 10)
/** FDCAN_IE_TCE TCE **/
#define FDCAN_IE_TCE		(1 << 9)
/** FDCAN_IE_HPME HPME **/
#define FDCAN_IE_HPME		(1 << 8)
/** FDCAN_IE_RF1LE RF1LE **/
#define FDCAN_IE_RF1LE		(1 << 7)
/** FDCAN_IE_RF1FE RF1FE **/
#define FDCAN_IE_RF1FE		(1 << 6)
/** FDCAN_IE_RF1WE RF1WE **/
#define FDCAN_IE_RF1WE		(1 << 5)
/** FDCAN_IE_RF1NE RF1NE **/
#define FDCAN_IE_RF1NE		(1 << 4)
/** FDCAN_IE_RF0LE RF0LE **/
#define FDCAN_IE_RF0LE		(1 << 3)
/** FDCAN_IE_RF0FE RF0FE **/
#define FDCAN_IE_RF0FE		(1 << 2)
/** FDCAN_IE_RF0WE RF0WE **/
#define FDCAN_IE_RF0WE		(1 << 1)
/** FDCAN_IE_RF0NE RF0NE **/
#define FDCAN_IE_RF0NE		(1 << 0)

/**@}*/

/** @defgroup fdcan_ils ILS The Interrupt Line Select register assigns an interrupt generated by a specific interrupt flag from the Interrupt Register to one of the two module interrupt lines. For interrupt generation the respective interrupt line has to be enabled via ILE[EINT0] and ILE[EINT1].
@{*/

/** FDCAN_ILS_ARAL ARAL **/
#define FDCAN_ILS_ARAL		(1 << 29)
/** FDCAN_ILS_PEDL PEDL **/
#define FDCAN_ILS_PEDL		(1 << 28)
/** FDCAN_ILS_PEAL PEAL **/
#define FDCAN_ILS_PEAL		(1 << 27)
/** FDCAN_ILS_WDIL WDIL **/
#define FDCAN_ILS_WDIL		(1 << 26)
/** FDCAN_ILS_BOL BOL **/
#define FDCAN_ILS_BOL		(1 << 25)
/** FDCAN_ILS_EWL EWL **/
#define FDCAN_ILS_EWL		(1 << 24)
/** FDCAN_ILS_EPL EPL **/
#define FDCAN_ILS_EPL		(1 << 23)
/** FDCAN_ILS_ELOL ELOL **/
#define FDCAN_ILS_ELOL		(1 << 22)
/** FDCAN_ILS_BEUL BEUL **/
#define FDCAN_ILS_BEUL		(1 << 21)
/** FDCAN_ILS_BECL BECL **/
#define FDCAN_ILS_BECL		(1 << 20)
/** FDCAN_ILS_DRXL DRXL **/
#define FDCAN_ILS_DRXL		(1 << 19)
/** FDCAN_ILS_TOOL TOOL **/
#define FDCAN_ILS_TOOL		(1 << 18)
/** FDCAN_ILS_MRAFL MRAFL **/
#define FDCAN_ILS_MRAFL		(1 << 17)
/** FDCAN_ILS_TSWL TSWL **/
#define FDCAN_ILS_TSWL		(1 << 16)
/** FDCAN_ILS_TEFLL TEFLL **/
#define FDCAN_ILS_TEFLL		(1 << 15)
/** FDCAN_ILS_TEFFL TEFFL **/
#define FDCAN_ILS_TEFFL		(1 << 14)
/** FDCAN_ILS_TEFWL TEFWL **/
#define FDCAN_ILS_TEFWL		(1 << 13)
/** FDCAN_ILS_TEFNL TEFNL **/
#define FDCAN_ILS_TEFNL		(1 << 12)
/** FDCAN_ILS_TFEL TFEL **/
#define FDCAN_ILS_TFEL		(1 << 11)
/** FDCAN_ILS_TCFL TCFL **/
#define FDCAN_ILS_TCFL		(1 << 10)
/** FDCAN_ILS_TCL TCL **/
#define FDCAN_ILS_TCL		(1 << 9)
/** FDCAN_ILS_HPML HPML **/
#define FDCAN_ILS_HPML		(1 << 8)
/** FDCAN_ILS_RF1LL RF1LL **/
#define FDCAN_ILS_RF1LL		(1 << 7)
/** FDCAN_ILS_RF1FL RF1FL **/
#define FDCAN_ILS_RF1FL		(1 << 6)
/** FDCAN_ILS_RF1WL RF1WL **/
#define FDCAN_ILS_RF1WL		(1 << 5)
/** FDCAN_ILS_RF1NL RF1NL **/
#define FDCAN_ILS_RF1NL		(1 << 4)
/** FDCAN_ILS_RF0LL RF0LL **/
#define FDCAN_ILS_RF0LL		(1 << 3)
/** FDCAN_ILS_RF0FL RF0FL **/
#define FDCAN_ILS_RF0FL		(1 << 2)
/** FDCAN_ILS_RF0WL RF0WL **/
#define FDCAN_ILS_RF0WL		(1 << 1)
/** FDCAN_ILS_RF0NL RF0NL **/
#define FDCAN_ILS_RF0NL		(1 << 0)

/**@}*/

/** @defgroup fdcan_ile ILE Each of the two interrupt lines to the CPU can be enabled/disabled separately by programming bits EINT0 and EINT1.
@{*/

/** FDCAN_ILE_EINT1 EINT1 **/
#define FDCAN_ILE_EINT1		(1 << 1)
/** FDCAN_ILE_EINT0 EINT0 **/
#define FDCAN_ILE_EINT0		(1 << 0)

/**@}*/

/** @defgroup fdcan_rxgfc RXGFC Global settings for Message ID filtering. The Global Filter Configuration controls the filter path for standard and extended messages as described in Figure706: Standard Message ID filter path and Figure707: Extended Message ID filter path.
@{*/


#define FDCAN_RXGFC_ANFS_SHIFT		4
#define FDCAN_RXGFC_ANFS_MASK		0x03
/** @defgroup fdcan_rxgfc_anfs ANFS ANFS
@{*/
/**@}*/


#define FDCAN_RXGFC_ANFE_SHIFT		2
#define FDCAN_RXGFC_ANFE_MASK		0x03
/** @defgroup fdcan_rxgfc_anfe ANFE ANFE
@{*/
/**@}*/

/** FDCAN_RXGFC_RRFS RRFS **/
#define FDCAN_RXGFC_RRFS		(1 << 1)
/** FDCAN_RXGFC_RRFE RRFE **/
#define FDCAN_RXGFC_RRFE		(1 << 0)

/**@}*/

/** @defgroup fdcan_xidam XIDAM FDCAN Extended ID and Mask Register
@{*/


#define FDCAN_XIDAM_EIDM_SHIFT		0
#define FDCAN_XIDAM_EIDM_MASK		0x1fffffff
/** @defgroup fdcan_xidam_eidm EIDM EIDM
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan_hpms HPMS This register is updated every time a Message ID filter element configured to generate a priority event match. This can be used to monitor the status of incoming high priority messages and to enable fast access to these messages.
@{*/

