grevaillot/svd_tools/headers/STM32G471xx/fdcan.h
/** FDCAN_HPMS_FLST FLST **/
#define FDCAN_HPMS_FLST		(1 << 15)

#define FDCAN_HPMS_FIDX_SHIFT		8
#define FDCAN_HPMS_FIDX_MASK		0x7f
/** @defgroup fdcan_hpms_fidx FIDX FIDX
@{*/
/**@}*/


#define FDCAN_HPMS_MSI_SHIFT		6
#define FDCAN_HPMS_MSI_MASK		0x03
/** @defgroup fdcan_hpms_msi MSI MSI
@{*/
/**@}*/


#define FDCAN_HPMS_BIDX_SHIFT		0
#define FDCAN_HPMS_BIDX_MASK		0x3f
/** @defgroup fdcan_hpms_bidx BIDX BIDX
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan_rxf0s RXF0S FDCAN Rx FIFO 0 Status Register
@{*/

/** FDCAN_RXF0S_RF0L RF0L **/
#define FDCAN_RXF0S_RF0L		(1 << 25)
/** FDCAN_RXF0S_F0F F0F **/
#define FDCAN_RXF0S_F0F		(1 << 24)

#define FDCAN_RXF0S_F0PI_SHIFT		16
#define FDCAN_RXF0S_F0PI_MASK		0x3f
/** @defgroup fdcan_rxf0s_f0pi F0PI F0PI
@{*/
/**@}*/


#define FDCAN_RXF0S_F0GI_SHIFT		8
#define FDCAN_RXF0S_F0GI_MASK		0x3f
/** @defgroup fdcan_rxf0s_f0gi F0GI F0GI
@{*/
/**@}*/


#define FDCAN_RXF0S_F0FL_SHIFT		0
#define FDCAN_RXF0S_F0FL_MASK		0x7f
/** @defgroup fdcan_rxf0s_f0fl F0FL F0FL
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan_rxf0a RXF0A CAN Rx FIFO 0 Acknowledge Register
@{*/


#define FDCAN_RXF0A_F0AI_SHIFT		0
#define FDCAN_RXF0A_F0AI_MASK		0x3f
/** @defgroup fdcan_rxf0a_f0ai F0AI F0AI
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan_rxf1s RXF1S FDCAN Rx FIFO 1 Status Register
@{*/


#define FDCAN_RXF1S_DMS_SHIFT		30
#define FDCAN_RXF1S_DMS_MASK		0x03
/** @defgroup fdcan_rxf1s_dms DMS DMS
@{*/
/**@}*/

/** FDCAN_RXF1S_RF1L RF1L **/
#define FDCAN_RXF1S_RF1L		(1 << 25)
/** FDCAN_RXF1S_F1F F1F **/
#define FDCAN_RXF1S_F1F		(1 << 24)

#define FDCAN_RXF1S_F1PI_SHIFT		16
#define FDCAN_RXF1S_F1PI_MASK		0x3f
/** @defgroup fdcan_rxf1s_f1pi F1PI F1PI
@{*/
/**@}*/


#define FDCAN_RXF1S_F1GI_SHIFT		8
#define FDCAN_RXF1S_F1GI_MASK		0x3f
/** @defgroup fdcan_rxf1s_f1gi F1GI F1GI
@{*/
/**@}*/


#define FDCAN_RXF1S_F1FL_SHIFT		0
#define FDCAN_RXF1S_F1FL_MASK		0x7f
/** @defgroup fdcan_rxf1s_f1fl F1FL F1FL
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan_rxf1a RXF1A FDCAN Rx FIFO 1 Acknowledge Register
@{*/


#define FDCAN_RXF1A_F1AI_SHIFT		0
#define FDCAN_RXF1A_F1AI_MASK		0x3f
/** @defgroup fdcan_rxf1a_f1ai F1AI F1AI
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan_txbc TXBC FDCAN Tx Buffer Configuration Register
@{*/

/** FDCAN_TXBC_TFQM TFQM **/
#define FDCAN_TXBC_TFQM		(1 << 30)

#define FDCAN_TXBC_TFQS_SHIFT		24
#define FDCAN_TXBC_TFQS_MASK		0x3f
/** @defgroup fdcan_txbc_tfqs TFQS TFQS
@{*/
/**@}*/


#define FDCAN_TXBC_NDTB_SHIFT		16
#define FDCAN_TXBC_NDTB_MASK		0x3f
/** @defgroup fdcan_txbc_ndtb NDTB NDTB
@{*/
/**@}*/


#define FDCAN_TXBC_TBSA_SHIFT		2
#define FDCAN_TXBC_TBSA_MASK		0x3fff
/** @defgroup fdcan_txbc_tbsa TBSA TBSA
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan_txfqs TXFQS The Tx FIFO/Queue status is related to the pending Tx requests listed in register TXBRP. Therefore the effect of Add/Cancellation requests may be delayed due to a running Tx scan (TXBRP not yet updated).
@{*/

/** FDCAN_TXFQS_TFQF TFQF **/
#define FDCAN_TXFQS_TFQF		(1 << 21)

#define FDCAN_TXFQS_TFQPI_SHIFT		16
#define FDCAN_TXFQS_TFQPI_MASK		0x1f
/** @defgroup fdcan_txfqs_tfqpi TFQPI TFQPI
@{*/
/**@}*/


#define FDCAN_TXFQS_TFGI_SHIFT		8
#define FDCAN_TXFQS_TFGI_MASK		0x1f
/** @defgroup fdcan_txfqs_tfgi TFGI TFGI
@{*/
/**@}*/


#define FDCAN_TXFQS_TFFL_SHIFT		0
#define FDCAN_TXFQS_TFFL_MASK		0x3f
/** @defgroup fdcan_txfqs_tffl TFFL TFFL
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan_txbrp TXBRP FDCAN Tx Buffer Request Pending Register
@{*/


#define FDCAN_TXBRP_TRP_SHIFT		0
#define FDCAN_TXBRP_TRP_MASK		0xffffffff
/** @defgroup fdcan_txbrp_trp TRP TRP
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan_txbar TXBAR FDCAN Tx Buffer Add Request Register
@{*/


#define FDCAN_TXBAR_AR_SHIFT		0
#define FDCAN_TXBAR_AR_MASK		0xffffffff
/** @defgroup fdcan_txbar_ar AR AR
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan_txbcr TXBCR FDCAN Tx Buffer Cancellation Request Register
@{*/


#define FDCAN_TXBCR_CR_SHIFT		0
#define FDCAN_TXBCR_CR_MASK		0xffffffff
/** @defgroup fdcan_txbcr_cr CR CR
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan_txbto TXBTO FDCAN Tx Buffer Transmission Occurred Register
@{*/


#define FDCAN_TXBTO_TO_SHIFT		0
#define FDCAN_TXBTO_TO_MASK		0xffffffff
/** @defgroup fdcan_txbto_to TO TO
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan_txbcf TXBCF FDCAN Tx Buffer Cancellation Finished Register
@{*/


#define FDCAN_TXBCF_CF_SHIFT		0
#define FDCAN_TXBCF_CF_MASK		0xffffffff
/** @defgroup fdcan_txbcf_cf CF CF
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan_txbtie TXBTIE FDCAN Tx Buffer Transmission Interrupt Enable Register
@{*/


#define FDCAN_TXBTIE_TIE_SHIFT		0
#define FDCAN_TXBTIE_TIE_MASK		0xffffffff
/** @defgroup fdcan_txbtie_tie TIE TIE
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan_txbcie TXBCIE FDCAN Tx Buffer Cancellation Finished Interrupt Enable Register
@{*/


#define FDCAN_TXBCIE_CFIE_SHIFT		0
#define FDCAN_TXBCIE_CFIE_MASK		0xffffffff
/** @defgroup fdcan_txbcie_cfie CFIE CFIE
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan_txefs TXEFS FDCAN Tx Event FIFO Status Register
@{*/

/** FDCAN_TXEFS_TEFL TEFL **/
#define FDCAN_TXEFS_TEFL		(1 << 25)
/** FDCAN_TXEFS_EFF EFF **/
#define FDCAN_TXEFS_EFF		(1 << 24)

#define FDCAN_TXEFS_EFPI_SHIFT		16
#define FDCAN_TXEFS_EFPI_MASK		0x1f
/** @defgroup fdcan_txefs_efpi EFPI EFPI
@{*/
/**@}*/


#define FDCAN_TXEFS_EFGI_SHIFT		8
#define FDCAN_TXEFS_EFGI_MASK		0x1f
/** @defgroup fdcan_txefs_efgi EFGI EFGI
@{*/
/**@}*/


#define FDCAN_TXEFS_EFFL_SHIFT		0
#define FDCAN_TXEFS_EFFL_MASK		0x3f
/** @defgroup fdcan_txefs_effl EFFL EFFL
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan_txefa TXEFA FDCAN Tx Event FIFO Acknowledge Register
@{*/


#define FDCAN_TXEFA_EFAI_SHIFT		0
#define FDCAN_TXEFA_EFAI_MASK		0x1f
/** @defgroup fdcan_txefa_efai EFAI EFAI
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan_ckdiv CKDIV FDCAN CFG clock divider register
@{*/


#define FDCAN_CKDIV_PDIV_SHIFT		0
#define FDCAN_CKDIV_PDIV_MASK		0x0f
/** @defgroup fdcan_ckdiv_pdiv PDIV input clock divider. the APB clock could be divided prior to be used by the CAN sub
@{*/
/**@}*/


/**@}*/
